
k='''1. 들의 콩깍지는 깐 콩깍지인가 안깐 콩깍지인가. 깐 콩깍지면 어떻고 안 깐 콩각지면어떠냐. 깐 콩깍지나 안 깐 콩깍지나 콩깍지는 다 콩깍지인데
2. 간장 공장 공장장은 강 공장장이고, 된장 공장 공장장은 공 공장장이다.
3. 저 분은 백 법학박사이고 이 분은 박 법학박사이다.
4. 작년에 온 솥장수는 새솥장수이고, 금년에 온 솥장수는 헌 솥장수이다.
5. 상표 붙인 큰 깡통은 깐 깡통인가? 안 깐 깡통인가?
6. 신진 샹숑가수의 신춘 샹숑쇼우
7. 서울특별시 특허허가과 허가과장 허과장
8. 저기 저 뜀틀이 내가 뛸 뜀틀인가 내가 안뛸 뜀틀인가
9. 앞 집 팥죽은 붉은 팥 풋팥죽이고 , 뒷집 콩죽은 햇콩단콩 콩죽, 우리집 깨죽은 검은깨 깨죽인데 사람들은 햇콩 단콩 콩죽 깨죽 죽먹기를 싫어하더라.
10. 우리집 옆집 앞집 뒷창살은 흩겹창살이고, 우리집 뒷집 앞집 옆창살은 겹흩창살이다.

11. 내가 그린 기린 그림은 긴 기린 그림이고 니가 그린 기린 그림은 안 긴 기린 그림이다
12. 저기 계신 저 분이 박 법학박사이시고, 여기 계신 이분이 백 법학 박사이시다.
13. 저기 가는 저 상장사가 새 상 상장사냐 헌 상 상장사냐.
14. 중앙청 창살은 쌍창살이고, 시청의 창살은 외창살이다.
15. 멍멍이네 꿀꿀이는 멍멍해도 꿀꿀하고, 꿀꿀이네 멍멍이는 꿀꿀해도 멍멍하네
16. 저기 있는 말뚝이 말 맬 말뚝이냐, 말 못 맬 말뚝이냐.
17. 옆집 팥죽은 붉은 팥죽이고, 뒷집 콩죽은 검은 콩죽이다.
18. 경찰청 쇠창살 외철창살, 검찰청 쇠창살 쌍철창살
19. 경찰청 철창살이 쇠철창살이냐 철철창살이냐
20. 내가 그린 구름그림은 새털구름 그린 구름그림이고, 네가 그린 구름그림은 깃털구름 그린 구름그림이다.

21. 칠월칠일은 평창친구 친정 칠순 잔칫날
22. 고려고 교복은 고급교복이고 고려고 교복은 고급원단을 사용했다.
23. 저기 가는 상장사가 헌 상장사냐 새 상장사냐
24. 대우 로얄 뉴로얄
25. 한국관광공사 곽진광 관광과장
26. 생각이란 생각하면 생각할수록 생각나는것이 생각이므로 생각하지않는 생각이 좋은생각이라 생각한다.
27. 인천 간장공장 공장장은 장공장장이고, 부천 강장공장 공장장은 양공장장이다
28. 김서방네 지붕위에 콩깍지가 깐콩깍지냐 안깐콩깍지이냐?
29. 앞뜰에 있는 말뚝이 말맬말뚝이냐 말안맬말뚝이냐
30. 내가 그린 기린그림은 잘 그린 기린그림이고 네가 그린 기린그림은 잘못그린 기린그림이다.

31. 안촉촉한 초코칩 나라에 살던 안촉촉한 초코칩이 촉촉한 초코칩 나라의 촉촉한 초코칩을 보고 촉촉한 초코칩이 되고 싶어서 촉촉한 초코칩 나라에 갔는데 촉촉한 초코칩 나라의 문지기가 `넌 촉촉한 초코칩이 아니고 안촉촉한 초코칩이니까 안촉촉한 초코칩나라에서 살아`라고해서 안촉촉한 초코칩은 촉촉한 초코칩이 되는것을 포기하고 안촉촉한 초코칩 나라로 돌아갔다
32. 내가 그린 구름 그림은 새털 구름 그린 그림이고
네가 그린 구름 그림은 솜털 구름 그린 그림이다.
33. 복씨 땅콩 장수의 막 볶은 따뜻한 땅콩
안씨 땅콩 장수의 들 볶은 뜨뜻한 땅콩
34. 앞집 안방 장판장은 노란꽃 장판장이고
뒷집 안방 장판장은 빨간꽃 장판장이다
35. 박범복군은 밤벚꽃놀이를 가고
방범복양은 낮벚꽃놀이를 간다
36. 정경담당 정선생님 상담담당 성선생님
37. 철수 책상 새 책상, 철수 책장 헌 책장
칠수 책상 새 책상, 칠수 책장 헌 책장
38. 육통 통장 적금통장은 황색 적금 통장이고
팔통 통장 적금통장은 녹색 적금 통장이다
39. 작은 토끼 토끼통 옆에는 큰 토끼 토끼통이 있고
큰 토끼 토끼통 옆에는 작은 토끼 토끼통이 있다
40. 저기 저 한국항공화물항공기는 출발할 한국 항공 화물 항공기인가
출발 안 할 한국 항공 화물 항공기인가

41. 도토리가 문을 도로록, 드르륵, 두루룩 열었는가
도루륵, 드로록, 두르룩 열었는가
42. 땅바닥 다진 닭발바닥 발자국
땅바닥 다진 말발바닥 발자국
43. 박 법학박사 뿔물 뿌리는 소뿔물 뿌리고
곽 법학박사 뿔물 뿌리는 양뿔물 뿌리다
44. 경창철 창살은 쇠 쌍창살이고
검찰청 창살은 철 쌍창살이다
45. 작은 용 이름은 용룡이고
큰 용의 이름은 룡용이다
46. 봄 꿀밤 단 꿀밤
가을 꿀밤 안단 꿀밤
47. 챠프포프킨과 치스챠코프는 라흐마니노프의 피아노 콘체르토의 선율이 흐르는 영화 파워트 웨이트를 보며 포테이토 칩, 파파야 등을 포식하였다
48. 백화 백화점 옆 백합 백화점 백합 백화점 옆 백화 백화점
49. 시골 찹쌀 햇찹쌀 도시찹쌀 촌찹쌀
50. 춘천 공작창 창장은 편창장이고 평촌 공작창 창장은 황창장입니다

51. 중앙청 창살 쇠창살, 검찰청 창상 쌍창살, 경찰청 창살 철창살
52. 내가 그린 기린 그림이 잘 그린 기린 그림인가, 못 그린 기린 그림인가
53. 강낭콩 옆 빈 콩깍지는 완도쿵 깐 빈 콩깍지인가, 강낭콩 깐 빈 콩깍지인가
54. 시청 창살 쇠창살 구청 창살 헌창살
55. 신진 샹숑가수의 신춘 샹숑쇼우
56. 귀돌이네 담 밑에서 귀뚜라미가 귀뚤뚤뚤 귀뚤뚤뚤
똘똘이네 담 밑에서 귀뚜라미가 뚤둘둘둘 뚤둘둘둘
57. 양양역앞 양장점은 양양양장점이고
영양역앞 영화관은 영양영화관이다
58. 한국관광공사 곽진광 관광과장
59. 박씨네 복국값밥은 복국값밥이냐 국값밥이냐
60. 앙증맞은 우리 아기 앙앙앙 울음보가 터지면
아빠도 엄마도 언니도 오빠도 아무도 못 말려요.

61. 경찰청 창살은 녹슨 창살인가 안 녹슨 창살인가
62. 십년 삽장사 헛삽장사 삼십년 삽장사 헌삽장사
63. 호동이 밥집 술국 밥값 갚고
외나무 밥집 장국 밥값은 안 갚고 내빼려고 한다
64. 그집 콩밭은 검정콩밭이며 우리집 콩밭은
강낭콩밭인데 검정콩 밭 옆에 강낭콩 밭이있고 강낭콩 밭옆에 검정콩밭이 있다
65. 철수 책상 새 책상 영희 책상 책책상
66. 내 구름 새 구름 니 구름 게 구름
67. 건넛마을 김부자댁 시렁위에 얹힌 푸른 청청 조좁쌀은
쓸은푸른 청청 조좁쌀이냐 안 쓸은 푸른 청청 조좁쌀이냐
68. 똘똘이네 알뜰이는 한푼두푼 알뜰살뜰
털털이네 흥청이는 서푼네푼 흥청망청
69. 백합백화점 옆 백화백화점
백화백화점 옆 백합백화점
70. 동해파도 철썩찰싹 철찰싹
남해파도 찰싹철썩 찰철썩

71. 된장공장주방장과 김공장주방장은 박주방장이고
마늘공장주방장과 파공장 주방장은 곽주방장이다.
72. 강낭콩 옆 빈콩깍지는 완두콩 깐빈 콩깍지이고
완두콩 옆빈 콩까지는 강낭콩 깐 빈콩깍지이다.
73. 양양역옆 양장점은 양양양장점이고
영양역옆 양장점은 영양양장점이다.
74. 재석이네 앞집팥죽은 붉은 팥 풋 팥죽이고
뒷집 콩죽은 햇콩 단콩 콩죽이다.
75. 춘천 공장창 창장은 편 창장이고,
편촌 공작창 창장은 황 창장입니다.
76. 저기 저 미트소시지소스스파게티는
크림소시지소스스테이크보다 비싸다
77. 앞집 꽃집은 장미꽃 꽃집이고
옆집 꽃꽃이집은 튤립꽃 꽃꽃이집이다.
78. 닭발바닥은 싸움닭발바닥이
제일크고 밤발바닥은 쌍밤발바닥이 제일 크다
79. 닭발바닥은 싸움닭발바닥이 제일크고
밤발바닥은 쌍밤발바닥이 제일 크다
80. 신랑은 신신애신사와 실랑이를 벌이고 있다.

81. 철수책상을 새 철책상으로 바꿀까? 새 쇠책상으로 바꿀까?
82. 불불이네 벨벨이는 벨벨하고 불불하고
벨벨이네 불불이는 벨벨하고 불불 하다.
83. 명계남의 명연기, 명장면, 명대사는 명품 연기이다.
84. 저기 내려오는 별똥별은 빛나는
쌍번별똥별인가? 빛나는 쌍범별똥별인가?
85. 사람이 사람이면 다 사람이냐
사람이면 사람구실을 해야 사람이지.
86. 장이 없어서 장을 구하러 장에 갈까 했더니
장이 아파서 장에도 못가고 장맛도 못 봤다
87. 배가 아파서 배밭에 나가 배를 먹는데
배를 타고 가던 사공이 배가 아프냐 배가 아프냐 묻더라
88. 밤이 익어서 밤에 밤따러 갔더니
밤이 어두워 밤은 못 따고 밤만 깊어 가더라.
89. 우리집 옆에 간장공장이 있고
간장공장 옆에 된장공장이 있고
된장공장 옆에 고추장공장이 있고
간장공장, 된장공장, 고추장공 장에는 공장장들이 있습니다.
90. 우리집에 안 깐 깡통이 두 개 있고
깐 깡통이 한 개 있습니다. 깡통은
깐 깡통과 안깐 깡통 모두 세 개 입니다.

91. 다람 다람 다람쥐 알밤 줍는 다람쥐
보름보름 달밤에 알밤줍는 다람쥐
92. 엄마 볼은 매끈 매끈 아
빠 볼은 까끌 까끌 내 볼은 포동포동
93. 몽실몽실 두리몽실 감기같은 내 얼굴
뭉실뭉실 두리뭉실 호박같은 네 얼굴
94.가랑 가랑 가랑비 오면 가갸거겨
개구리가 노래를 하고 개구리가 가갸거겨
노래를 하면 가랑비가 가랑가랑 내린답니다.
95. 그 집 콩밭은 검정 콩밭이고 내 집 콩밭은 강낭콩밭이며
검정 콩밭 옆에 강낭콩밭이 있고 강낭콩밭 옆에 검정콩밭이 있다.
96. 나풀 나풀 나비가 나팔꽃에 날아가 놀고 있는데
날리리 날리리 나팔소리에 놀라 나팔꽃에서
놀지 못하고 나리꽃으로 날아갔대요.
97. 담임 선생님의 담당과목은 도덕담당이고
담임 닮은 담임선생님의 단골집 담 큰 주인은
닭장에서 닭모이를 주는게 그의 취미이다.
98. 라일락꽃 같은 라이안의 처녀들이 랄라라라 랄라라라 춤을 춥니다.
99.모락 모락 맛있는 만두를 말썽꾸러기
말복이가 마굿간 말들에게 말없이 주어버린 말썽스런 일이 있었다.
100. 숲속 동굴 속에 숨어 있는 살쾡이가 살랑살랑 살쾡이 꼬리를
살래살래 흔들면서 살금살금 슬금슬금 사람들을 살살 피해 다닌다.

101. 앙증맞은 우리 아기 앙앙앙 울음보가 터지면
아빠도 엄마도 언니도 오빠도 아무도 못 말려요.
102. 잘 익지 않는 고기는 잘근잘근 썰어서
조물조물 주물주물 주물러 주신 후 다시 구우세요.
103. 추운 겨울에도 초롱이는 칫솔에 치약을 묻혀서
치카푸카 치카푸카 칫솔질을 해요.
104. 키가 큰 코끼리가 쿨쿨 코를 골며 자고 있는데
쿵쿵쿵 큰 소리를 내며 코뿔소가 키 작은 코알라에게
다가갔어요. 키 작은 코알라는 콩콩콩 가슴이 뛰었지요.
105.탱글 탱글 오렌지를 톡 터뜨리면 새콤 달콤 오렌지 쥬스가 되지요.
106. 탱글 탱글 토마토를 통째로 한입에 먹을까,
통글 통글 토마토를 토막 토막 썰어서 나눠 먹을까
107. 포도밭에서 먹는 포도는 포도향기가 퐁퐁 풍기고
포장마차에서 먹는 파전은 파 냄새가 팡팡 풍긴다.
108. 하늘의 하얀 구름은 요술쟁인가봐.
하마도 되고 호랑이도 되고! 해님도 하하하 웃고 있네요.
109. 찹쌀떡 떡방아는 덩더쿵 떡방아, 멥쌀떡 떡방아는 쿵더쿵 떡방아
110. 앞집 박서방네 방망이 소리는 닥달 방망이 소리,
뒷집 봉서방네 방망이 소리는 박달 방망이 소리

111. 다우네 외가는 외중에 있고, 다우네 외숙모는 윗마을에 있다.
112. 라디오는 랄라라라 노래하고, 나는 릴라라라 춤을 춰요.
113. 마차는 덜컹덜컹 우차는 삐그덕 삐그덕.
114. 몽실몽실 두리몽실 호박같은 내얼굴 뭉실뭉실 두리뭉실 감자같은 내엉덩이
115. 버스타고 꼬부랑길을 꼬불 깽깽 꼬불꼬불 뱅뱅돈다.
116. 새장 속에 횐 꼬리새는 새장사를 싫어한다.
117. 강 건너 강 공장장은 간장 공장 공장장이고
강 안 건너 공 공장장은 된장 공장 공장장이다.
118. 니 붕어 알이 크냐 내 붕어 알이 크냐
119. 자기야 자기는 자기가 아닌 다른 자기가
자기보고 자기라고 하면 자기는 자기라고 할 수 있어 자기
120. 대공원에 봄 벚꽃 놀이는 낮 봄 벚꽃 놀이보다 밤 봄 벚꽃 놀이니라.

121. 저 건너 장서방네 지붕에 앉은 수탉은
큰 장서방네 수탉이냐? 작은 장서방네 수탉이냐?
122. 대한관광, 대한관광공사, 대한관광공사 공무원
123. 조달청, 조달청 청사, 조달청 청사 창살, 조달청 창살 쌍창살
124. 항만청, 항만청 청사, 항만청 청사 쇠창살
125. 똘똘이네똑똑이는똘똘하고똑똑이네똘똘이는똑똑하다.
126. 깊은산속 부엉이는 부엉 부엉하고 깊은 계곡 꾀꼬리는 꾀꼴 꾀꼴한다 127. 호동이 좋아하는 천연과일과즙음료는
라임과일과즙음료인가? 석류과일과즙음료인가?
128. 제동이 좋아하는 천연과일과즙음료는
감귤과즙음료인가? 메론과즙음료인가?
129. 강창성해운항만 청장과 진봉준 강릉전 매청장
130. 편판선군과 판편숙양의 결혼 답례용 증정품

131. 마늘 속 알리신 살균항균작용이 높은가?
페니실린의 살균항균작용이 높은가?
132. 우유성분 함유율은 칼슘함유량이 철분함유랑보다 높은가?
철분함류양이 칼슘함유량보다 높은가?

'''
k = k.replace('\n',' ').replace('  ',' ').split(' ')
count={}
for kwd in k:
    if kwd in count:
        count[kwd] += 1
    else:
        count[kwd] = 1
a = sorted(count.items(), key=lambda x: x[1])    

for k1, v1 in a:
    print(' {0:8s} {1:5s} '.format(k1,str(v1)))

print("-------------------------------------")
count={}
for kwd in k:
    count.setdefault(kwd,0)
    count[kwd] += 1
a = sorted(count.items(), key=lambda x: x[1])    

for k1, v1 in a:
    print(' {0:8s} {1:5s} '.format(k1,str(v1)))